In [25]:
import sqlite3
import pandas as pd
import warnings

warnings.filterwarnings('ignore')

In [26]:
conn = sqlite3.connect("main.db")

In [27]:
raw = pd.read_csv(r"./source/Rad_Account.csv")
rad_account = raw.copy()
rad_account.columns = rad_account.columns.str.replace(' ', "")
rad_account['AccountNo'] = rad_account['AccountNo'].astype(str)

In [28]:
sql = "SELECT Id, AccountNo FROM Account;"
accounts = pd.read_sql(sql, conn)
accounts['AccountNo'] = accounts['AccountNo'].astype(str)
accounts.head()

    Id AccountNo
0  211     11000
1  212     11100
2  213     11200
3  240     11298
4  176     11299

In [40]:
merge = pd.merge(rad_account, accounts, on='AccountNo')
merge = merge[['RADTypeId', 'Id']]
merge = merge.rename(columns={'RADTypeId': 'RadTypeId', 'Id': 'AccountId'})
merge.dropna(inplace=True)
merge.head()

  RadTypeId  AccountId
0      BENE        134
1      BENE        133
2      BENE        132
3      BENE        131
4       CIP         42

In [41]:
def import_func(df: pd.DataFrame()) -> None:
    df.to_sql('Account_RadType', conn, if_exists='append', index=False)
    
import_func(merge)